{"Id": 1, "PostTypeId": 1, "CreationDate": "2011-04-18T20:36:37.233", "Score": 5, "ViewCount": 63, "Body": "<p>Is it repetitive to have \"How does\", \"How can\", \"How do\" in the title of a question? Is there a better format or layout that could be used to cut down on this if it is too repetitive?</p>\n", "OwnerUserId": 14, "LastEditorUserId": 14, "LastEditorDisplayName": "", "LastEditDate": "2011-04-18T20:44:15.090", "LastActivityDate": "2011-04-20T00:37:11.323", "Title": "\"How does\" repetitive?", "Tags": ["discussion"], "AnswerCount": 2, "CommentCount": 6}
{"Id": 2, "PostTypeId": 1, "CreationDate": "2011-04-18T20:42:40.257", "Score": 3, "ViewCount": 26, "Body": "<p>This is my first private beta in SE and I feel that this topic needs some solid rules regarding tags, seeing as how broad they can get. I propose to break down every topic into \"fields\". Some possible fields would be:</p>\n\n<ul>\n<li><strong>Science</strong> (possibly break this one down, ie physics, chem etc)</li>\n</ul>\n\n<p>Examples: How does electricity work? How does the Sun heat the Earth?</p>\n\n<ul>\n<li><strong>Technology</strong></li>\n</ul>\n\n<p>Examples: How does data get written to a CD? How do computers display video?</p>\n\n<ul>\n<li><strong>Mechanics</strong></li>\n</ul>\n\n<p>Examples: How do cars use fuel? How do pulleys work?</p>\n\n<p>These are the main ideas I can come up with right now, but I'm sure more will come. Hopefully this will keep the tags clean and make subscribing via RSS worth it for more people.  </p>\n\n<p>Maybe even break down those sections into subsections ie: mechanics-cars, technology-hardware</p>\n", "OwnerUserId": 16, "LastActivityDate": "2011-04-18T23:29:31.943", "Title": "Tag scheme proposal", "Tags": ["discussion", "feature-request"], "AnswerCount": 1}
{"Id": 3, "PostTypeId": 2, "ParentId": 1, "CreationDate": "2011-04-18T20:44:16.260", "Score": 3, "ViewCount": 0, "Body": "<p>We could push people to create titles of the sort:</p>\n\n<ul>\n<li>\"Writing to Blu-Ray discs\"</li>\n<li>\"Starting a car\"</li>\n<li>\"Pulleys and simple machines\"</li>\n</ul>\n\n<p>I agree that the \"How does\" will become VERY boring</p>\n", "OwnerUserId": 16, "LastActivityDate": "2011-04-18T20:44:16.260", "CommentCount": 1}
{"Id": 4, "PostTypeId": 1, "AcceptedAnswerId": 16, "CreationDate": "2011-04-18T21:18:32.247", "Score": 10, "ViewCount": 84, "Body": "<p>In the question <a href=\"http://htw.stackexchange.com/questions/1/how-can-blu-ray-discs-store-a-huge-number-of-data\">How Blueray works</a> the answer is a link and 'liberated' content from <a href=\"http://howstuffworks.com\" rel=\"nofollow\">howstuffworks.com</a>.  Why is this site different than that site?  </p>\n\n<p>Other than having the Stack engine behind it to allow content to be more alive?</p>\n", "OwnerUserId": 34, "LastActivityDate": "2011-04-20T02:01:50.213", "Title": "Why is the answer to most questions, not just a link to howstuffworks.com?", "Tags": ["discussion", "asking-questions", "duplication"], "AnswerCount": 6, "FavoriteCount": 2}
{"Id": 5, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-18T21:24:41.810", "Score": 2, "ViewCount": 0, "Body": "<p>The \"perfect answer\" that I see to a question like that would include a short summary of how it works (while answering any little questions the user has), followed by a link to howstuffworks.com or any other links that will go into more detail.</p>\n\n<p>I agree that a lot of the content that is going to be asked here can be found somewhere on the net, but I think our goal is trying to bring everything together with good moderation and explain to the user \"how it works\" while giving them the correct path to go down.</p>\n", "OwnerUserId": 16, "LastActivityDate": "2011-04-18T21:24:41.810", "CommentCount": 3}
{"Id": 6, "PostTypeId": 2, "ParentId": 1, "CreationDate": "2011-04-18T21:27:42.097", "Score": 11, "ViewCount": 0, "Body": "<p>I think having \"How does\" will be a good boost for SEO purposes... Maybe it's repetitive but it <em>is</em> a \"how things work\" site, and if the question titles almost exactly match what people are typing into Google, this will probably help drive traffic to the site quite rapidly.</p>\n\n<p>I do think that when asking questions, we should try to consider other title structures though. \"What are the mechanics behind...?\", \"What causes <em>X</em> to work like <em>Y</em>?\", etc. But I do think they should remain as questions... IMHO anyway.</p>\n", "OwnerUserId": 20, "LastEditorUserId": 20, "LastEditorDisplayName": "", "LastEditDate": "2011-04-20T00:37:11.323", "LastActivityDate": "2011-04-20T00:37:11.323", "CommentCount": 6}
{"Id": 7, "PostTypeId": 1, "CreationDate": "2011-04-18T21:33:11.823", "Score": 4, "ViewCount": 46, "Body": "<p>When asking questions on the beta, we are reminded:</p>\n\n<blockquote>\n  <h2>Avoid \"easy\" questions</h2>\n  \n  <p>It's tempting to start with easy,\n  superficial questions: surveys, polls,\n  and rudimentary questions like \"what\n  are some good books on this topic\" or\n  \"what are the best blogs on this\n  topic.\" Those are not good questions\n  for the private beta, because\n  ultimately, they don't reflect the\n  actual content that we want this site\n  to contain, and are not representative\n  of it.</p>\n  \n  <h2>Think like an expert</h2>\n  \n  <p>Stick to actual, real, objective\n  questions with real answers that a\n  working professional or expert in this\n  field might encounter as a part of\n  their actual, real, job. Stock the\n  site with a bunch of on-topic, expert\n  questions and answers, so that when\n  the site opens to the public, it's\n  already pre-populated with a bunch of\n  the kind of content that will attract\n  other experts.</p>\n  \n  <h2>You get the site you build</h2>\n  \n  <p>The first questions set the tone and\n  topic of a site for a long time. Those\n  early questions say a lot about what\n  your community could become. And\n  questions asked during the private\n  beta will be on the front page when\n  potential experts see your site for\n  the first time. So please make those\n  first questions exemplary ones that\n  are interesting, challenging, and\n  worthy of imitation.</p>\n</blockquote>\n\n<p>Some of my questions I was afraid to post because they might be too \"easy\". What is our target audience? Who are the experts? What are some general rules to follow on good topics and ways to avoid questions that are too easy?</p>\n\n<p><strong>EDIT:</strong> As EvilPhoenix mentioned, there's another side to this: How do we define <em>good answers?</em> Personally I think that's the same as other StackExchange sites: Answers which are accurate, detailed, well written, link to good sources, and of course include freehand circles.</p>\n\n<p>Thoughts on these points?</p>\n", "OwnerUserId": 20, "LastEditorUserId": 20, "LastEditorDisplayName": "", "LastEditDate": "2011-04-18T23:27:53.100", "LastActivityDate": "2011-04-18T23:27:53.100", "Title": "Who is our target audience? Who are the experts?", "Tags": ["discussion", "asking-questions"], "AnswerCount": 1, "CommentCount": 2, "FavoriteCount": 2}
{"Id": 8, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-18T21:46:55.130", "Score": 2, "ViewCount": 0, "Body": "<p>Or if not howstuffworks.com, why not Wikipedia? Using Wikipedia as an example same question could apply to a lot of Stack Exchange sites. But that's the principle of StackExchange. howstuffworks.com or Wikipedia can be a great <em>source</em> for your answer, but your answer should stand alone. By creating a large volume of questions here, even if they link to howstuffworks.com as sources, we can eventually replace howstuffworks.com with a better, community-run site!</p>\n\n<p>That's the goal as I see it, anyway :-)</p>\n", "OwnerUserId": 20, "LastActivityDate": "2011-04-18T21:46:55.130", "CommentCount": 1}
{"Id": 9, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-18T21:51:04.390", "Score": 1, "ViewCount": 0, "Body": "<p>I think as always websites should be use to supplement your explanation, giving the asker direction for more information. Linking somewhere and saying look heren is wrong, but in this case the user explained it, which in my opinion, justifies the diagram</p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-18T21:51:04.390", "CommentCount": 2}
{"Id": 10, "PostTypeId": 1, "CreationDate": "2011-04-18T22:53:55.093", "Score": 1, "ViewCount": 23, "Body": "<p>There is HTW chat @ <a href=\"http://chat.stackexchange.com/rooms/427/how-things-work\">http://chat.stackexchange.com/rooms/427/how-things-work</a>\nCurrently there are 2 users, I like to see all of us in there.</p>\n", "OwnerUserId": 28, "LastEditorUserId": 28, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T02:41:36.483", "LastActivityDate": "2011-04-19T02:41:36.483", "Title": "We now have chat", "Tags": ["discussion", "chat"], "AnswerCount": 2}
{"Id": 11, "PostTypeId": 2, "ParentId": 7, "CreationDate": "2011-04-18T23:15:17.453", "Score": 4, "ViewCount": 0, "Body": "<p>I think that our target audience should be anyone who is curious about how various things work.  I.E. the normal person.  </p>\n\n<p>Having said that, rules to follow for good topics would be topics that can be answered to some level of detail, but not so much detail as to overload the standard user's attention span.</p>\n\n<p>Further, we should also be asking about how we should answer questions.  Good answers should be fairly to-the-point, while providing a decent level of detail.  Answers which do not include enough information to adequately answer the question (such as \"Go google it\" or \"This page here explains how it works: \", but not actually providing details in the answer about how something works) should be considered \"Not a good answer\" or a very very low-quality answer.</p>\n\n<p>As to who we should consider \"experts\", i believe we should break it down into various categories.<br>\nSuch categories could be:  </p>\n\n<ul>\n<li>Electronics Experts (electronics repair people, for example)</li>\n<li>Computer Experts (computer technicians, for example)</li>\n<li>Engineering Experts (engineers)</li>\n<li>Automobile experts (automobile repair people, people who build/design automobiles, etc. for automobile questions [I noticed a few of them already])</li>\n</ul>\n\n<p>Of course, the above list is NOT all inclusive.  For example, I might be considered a Computer Expert, as I am a computer technician who can answer questions regarding how computers and their hardware work (to some extent).</p>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-18T23:15:17.453", "CommentCount": 1}
{"Id": 12, "PostTypeId": 2, "ParentId": 10, "CreationDate": "2011-04-18T23:15:48.607", "Score": 0, "ViewCount": 0, "Body": "<p>At my office, I am allowed onto websites, but am forbidden from using chat systems that are not recorded by the IT department. At my last employer, the reasoning was that we were a publicly traded company and Sarbanes-Oxley requirements forbade it. At my current employer (part of the Department of Energy), it is forbidden by lots of regulations (not that we have any classified or non-public material at this office) and policies. At a place I worked earlier in my life, <a href=\"http://en.wikipedia.org/wiki/Financial_Industry_Regulatory_Authority\" rel=\"nofollow\">FINRA</a> regulations forbade anyone with a <a href=\"http://en.wikipedia.org/wiki/List_of_Securities_Examinations\" rel=\"nofollow\">FINRA license</a> from using any sort of IM client - even one logged and monitored by the company. Because I worked in an office with several Series 6 and 7 licensed folks, by extension I was forbidden from using chat. </p>\n\n<p>Short version: I am not allowed to. Sorry. </p>\n", "OwnerUserId": 74, "LastActivityDate": "2011-04-18T23:15:48.607"}
{"Id": 13, "PostTypeId": 2, "ParentId": 10, "CreationDate": "2011-04-18T23:17:23.503", "Score": 0, "ViewCount": 0, "Body": "<p>I am indeed aware the chat exists.  I've added it to my favorite chat rooms so that I won't forget it exists :P</p>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-18T23:17:23.503"}
{"Id": 14, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-18T23:19:29.647", "Score": 1, "ViewCount": 0, "Body": "<p>I try to give some links for reference material so that people can find out more information, and that usually means sites like wikipedia. Most of the time, people want a small nugget of information, but sometimes they want lots of details. It is hard to get that right - you bore the first group to death and you frustrate the second group with too few details. </p>\n\n<p>I would love to be able to make drawings to show things, but that's well beyond what I have time to do. </p>\n", "OwnerUserId": 74, "LastActivityDate": "2011-04-18T23:19:29.647"}
{"Id": 15, "PostTypeId": 2, "ParentId": 2, "CreationDate": "2011-04-18T23:29:31.943", "Score": 2, "ViewCount": 0, "Body": "<p>I think we should be very careful with your proposed \"Technology\" tag scheme...</p>\n\n<p>I believe that we should split that tag scheme down further, as \"Technology\" doesn't just relate to computer technology.  We should have some type of <strong>Computers</strong> tag to enclose all computer-related technology questions, where as we use some other type of tag to encompass other technology questions, such as questions relating to televisions, questions relating to telephones, and other various technology questions.</p>\n\n<p>I am in agreement with breaking down <strong>Science</strong> into individual categories.  Some of those categories could include (as per above and my own ideas):</p>\n\n<ul>\n<li><strong>Physics</strong></li>\n<li><strong>Chemistry</strong></li>\n<li><strong>Biology</strong> (for questions relating to how biological systems work)</li>\n<li><strong>Earth-Science</strong> (for questions relating to the earth, note overlap with the other categories is possible)</li>\n</ul>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-18T23:29:31.943", "CommentCount": 1}
{"Id": 16, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-18T23:54:46.403", "Score": 9, "ViewCount": 0, "Body": "<p>One of the strengths of Stack Exchange is that it can answer those detailed, long-tailed questions with a high degree of credibility and confidence; That the question can be answered objectively by someone who has personal or expert experience with that exact problem; That you don’t have to read through a lot of discussion to find the best answer, and that someone else can embellish it and make it even better. With most Stack Exchange sites, we expect questions to represent real problems, not just imponderables, hypotheticals, or requests for opinions. </p>\n\n<p><strong>Those are the criteria.</strong> That's what makes a good Stack Exchange site; Better than any other.</p>\n\n<p>But if this site is going to become an endless list of:</p>\n\n<blockquote>\n  <p>Question: How does [common object] work?</p>\n  \n  <p>Answer: According to HowStuffWorks and Wikipedia [common object] works by [rehashed description&hellip;]</p>\n</blockquote>\n\n<p>&hellip;there really <em>isn't</em> much use to this site.</p>\n\n<p>Consider for a moment &mdash; A private beta is where you finally apply the rudiments of the proposal to decide \"what is the purpose of this site?\" You have to ask yourself, how are we going to use this Q&amp;A engine and this community to create a canonical source of expert answers better than any other on this subject? Ask yourself how are you going to carry forward Stack Exchange's primary mission: </p>\n\n<h3>\"Make the Internet a BETTER place to get expert answers to your questions\"</h3>\n", "OwnerUserId": 42, "LastEditorUserId": 42, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T13:31:40.547", "LastActivityDate": "2011-04-19T13:31:40.547", "CommentCount": 1}
{"Id": 17, "PostTypeId": 1, "CreationDate": "2011-04-18T23:54:58.290", "Score": 1, "ViewCount": 27, "Body": "<p>Ultimately, we we'll get some questions on here which don't belong. Following some of the other sites, Josh and I setup a vote to close room <a href=\"http://chat.stackexchange.com/rooms/428/how-stuff-gets-closed\">here</a> where you can post links to posts or questions that don't need to be here so we can have then removed as a community effort.</p>\n", "OwnerUserId": 28, "LastEditorUserId": 42, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T03:14:26.737", "LastActivityDate": "2011-04-19T14:36:42.000", "Title": "Visit the \"Vote to Close\" chat room", "Tags": ["discussion", "chat"], "AnswerCount": 1, "FavoriteCount": 2}
{"Id": 18, "PostTypeId": 1, "CreationDate": "2011-04-19T01:25:03.047", "Score": 0, "ViewCount": 20, "Body": "<p>I bring this up in an attempt to help us determine acceptability of <strong>detailed</strong> answers.</p>\n\n<p>In regards to my own answer, located <a href=\"http://htw.stackexchange.com/questions/106/how-do-radio-signals-work/108#108\">here</a>, I'm a tad concerned about the acceptable level of detail in a question.  Granted, I could have formatted by answer better, but there's an issue with my internet browser parsing the data correctly :/</p>\n\n<p>At what point are answers <strong><em>too detailed</em></strong>, or too <em>wall-of-text-like</em> to be considered decent for askers to understand or not lose his/her interest in reading an answer?</p>\n", "OwnerUserId": 78, "LastEditorUserId": 78, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T01:46:28.043", "LastActivityDate": "2011-04-19T08:03:59.780", "Title": "Hard-to-read, wall-of-text answers: acceptable?", "Tags": ["discussion", "answers", "moderation"], "AnswerCount": 2, "CommentCount": 2}
{"Id": 19, "PostTypeId": 2, "ParentId": 18, "CreationDate": "2011-04-19T01:32:31.703", "Score": 1, "ViewCount": 0, "Body": "<p><strong>Never.</strong> You can't over add <em>relevant</em> information, The asker asked for a lot of information, and you posted it. In this case it mostly appears to be relevant, but you should watch for too much information that isn't useful that's when you run into issues. </p>\n\n<p>Also it appears that it is split up fairly well, I'll see if I can fix it a little.</p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-19T01:32:31.703", "CommentCount": 1}
{"Id": 20, "PostTypeId": 1, "CreationDate": "2011-04-19T01:58:51.430", "Score": 2, "ViewCount": 18, "Body": "<p>For example:</p>\n\n<blockquote>\n  <p>How do X and Y work, and how are they\n  different?</p>\n</blockquote>\n\n<p>when X and Y are related (e.g. LED vs Florescent Lights)?</p>\n", "OwnerUserId": 62, "LastActivityDate": "2011-04-19T06:40:09.307", "Title": "Is it okay to ask how two things are different?", "Tags": ["discussion", "asking-questions"], "AnswerCount": 3}
{"Id": 21, "PostTypeId": 2, "ParentId": 20, "CreationDate": "2011-04-19T02:09:06.113", "Score": 2, "ViewCount": 0, "Body": "<p>I don't see why not.  Such questions are basically at the most fundamental level two questions morphed into one: \"What are the differences between how X and Y operate?\"  which is basically the same as answering \"How does X work?\" and \"How does Y work?\" and \"What are the differences between X and Y?\" all in one question (aka: a three-in-one answer).</p>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-19T02:09:06.113"}
{"Id": 22, "PostTypeId": 2, "ParentId": 20, "CreationDate": "2011-04-19T02:09:54.493", "Score": 4, "ViewCount": 0, "Body": "<p>Well, we're still working on what should be allowed here, but if you ask how they are different, your asking how they work and contrasting. In my opinion yes, that's valid, but I'm curious to hear what other people will say here.</p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-19T02:09:54.493"}
{"Id": 23, "PostTypeId": 2, "ParentId": 20, "CreationDate": "2011-04-19T06:40:09.307", "Score": 1, "ViewCount": 0, "Body": "<p>I would strongly feel yes.  At least there is human discussion and expert knowledge going on, something that wikipedia alone can't tell you.</p>\n", "OwnerUserId": 59, "LastActivityDate": "2011-04-19T06:40:09.307"}
{"Id": 24, "PostTypeId": 1, "CreationDate": "2011-04-19T07:51:51.767", "Score": 1, "ViewCount": 18, "Body": "<p>What I noticed while posting a question, is that the system suggested me some related posts, obviously in an attempt to prevent asking an already answered question, but as most of the questions start with 'how do/does' and end with 'work', the system considered 'wifi', 'kinect' and a bunch more, all related to 'nuclear reactor' the question was about.\n<img src=\"http://i.imgur.com/HJlk9.png\" alt=\"Screen cap\">\nApparently the way these related posts are matched needs an improvement to ignore some trivial terms like 'how', 'do', 'work' etc.</p>\n\n<p>What do you guys think?</p>\n", "OwnerUserId": 111, "LastEditorUserId": 42, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T14:14:32.147", "LastActivityDate": "2011-04-19T14:40:46.050", "Title": "\"Related posts\" suggestions improvement", "Tags": ["discussion", "feature-request"], "AnswerCount": 1, "CommentCount": 1}
{"Id": 25, "PostTypeId": 2, "ParentId": 18, "CreationDate": "2011-04-19T08:03:59.780", "Score": 2, "ViewCount": 0, "Body": "<p>I agree with the opinion that a lot of information is never too much (unless it's redundant).</p>\n\n<p>I'd also suggest that in case there is a lot of information to post, the poster should organize it a bit (I'm not saying that you didn't organize your post, on the contrary, it seems quite alright). </p>\n\n<p>My point is that if the answer is going to span a couple screens, in order to make it more readable, some indentation plus logic order would be much appreciated. A good example of information order seems to have been implemented by the Wiki's: with the summary on top, which gives you more or less an idea of what the article is about; but in case one wants to get into more details, they should read further. I guess it's not much of an overhead to summarize in a couple lines what you are about to describe.</p>\n", "OwnerUserId": 111, "LastActivityDate": "2011-04-19T08:03:59.780"}
{"Id": 26, "PostTypeId": 1, "CreationDate": "2011-04-19T13:01:18.397", "Score": 2, "ViewCount": 44, "Body": "<p>I have seen some physics questions here, and I wonder which site to choose between this one and the Physics one. What exactly should be the criteria?</p>\n", "OwnerUserId": 121, "LastActivityDate": "2011-04-21T13:08:52.570", "Title": "Concern regarding overlap with physics-SE", "Tags": ["discussion"], "AnswerCount": 4, "CommentCount": 1}
{"Id": 27, "PostTypeId": 2, "ParentId": 26, "CreationDate": "2011-04-19T13:31:08.103", "Score": 5, "ViewCount": 0, "Body": "<p>I think the question is best answered by determining if you want to know <em>how an object or technology works</em> verses <em>what the mechanics behind an actual physics subject are</em>. For example, I asked <a href=\"http://htw.stackexchange.com/q/67/20\">how powerline technology works</a> and I did say I am interested in what actually happens to the electrical current. So I do want a technical, physics explanation. However I am asking about the <em>technology</em> of Ethernet over Powerline, <em>not</em> the academic subject of electricity. So I believe it's on-topic here and not at physics.stackexchange.com.</p>\n\n<p>Put another way: If you want to know <em>how something works</em>, ask here. If you want <em>the mathematics behind a physical reaction or the scientific explanation of something</em>, ask on <a href=\"http://physics.stackexchange.com\">http://physics.stackexchange.com</a>. You could <em>almost</em> compare it to SuperUser verses StackOverflow: If it's a general questions about computers or how to make them do things, ask on SuperUser. If you want a computer science answer about programming ask on StackOverflow.</p>\n\n<p>Put in a simpler way: I think the target audience of this site should be the \"everyman\". If you have a question about how something works that the everyday person might ask or want to read the answer to, ask on here. If you're a scientist or want a scientific explanation which would be too in-depth and above the average person's level of interest, ask on <a href=\"http://physics.stackexchange.com/\">physics.stackexchange.com</a>.</p>\n", "OwnerUserId": 20, "LastEditorUserId": 20, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T14:41:16.737", "LastActivityDate": "2011-04-19T14:41:16.737", "CommentCount": 1}
{"Id": 28, "PostTypeId": 2, "ParentId": 17, "CreationDate": "2011-04-19T14:36:42.000", "Score": 0, "ViewCount": 0, "Body": "<p>Currently <a href=\"http://meta.htw.stackexchange.com/users/28/jacob\">Jacob</a> and I are room owners of the <a href=\"http://chat.stackexchange.com/rooms/428/how-stuff-gets-closed\">\"How Stuff Gets Closed\" room</a>. If you have any concerns about that room, or feel you should be a room owner as well, contact one of us either on chat or on this question.</p>\n", "OwnerUserId": 20, "LastActivityDate": "2011-04-19T14:36:42.000"}
{"Id": 29, "PostTypeId": 2, "ParentId": 24, "CreationDate": "2011-04-19T14:40:46.050", "Score": 0, "ViewCount": 0, "Body": "<p>I think we should have someone try and augment the system for detecting similar questions, at least for here, to increase the actual relevance of suggested duplicates.</p>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-19T14:40:46.050", "CommentCount": 4}
{"Id": 30, "PostTypeId": 1, "CreationDate": "2011-04-19T15:00:03.017", "Score": 2, "ViewCount": 41, "Body": "<p>I just realized this this morning, and this discussion is related to this one, but is more decentralized than this one:<br>\n<a href=\"http://meta.htw.stackexchange.com/questions/26/concern-regarding-overlap-with-physics-se\">Concern regarding overlap with physics-SE</a></p>\n\n<p>If we have overlap with physics-SE, we're bound to have overlap with other SE sites.  Should we truly be worried about this?  To some extent, overlap is expected, this is true with all SE sites (for example, the AskUbuntu SE overlaps partly with other SE sites because of Linux overlap, and maybe some programming overlap), but is especially true for ours, because HTW can cover mostly anything, and there is probably already a specialized SE site for each individual category of questions.</p>\n", "OwnerUserId": 78, "LastActivityDate": "2011-04-21T13:12:04.597", "Title": "Potential for mass-overlap with other SE sites", "Tags": ["discussion", "questions"], "AnswerCount": 3, "FavoriteCount": 1}
{"Id": 31, "PostTypeId": 2, "ParentId": 30, "CreationDate": "2011-04-19T16:35:16.780", "Score": 2, "ViewCount": 0, "Body": "<p>I am not overly concerned about this. I think that, <a href=\"http://meta.htw.stackexchange.com/questions/26/concern-regarding-overlap-with-physics-se/27#27\">as I mentioned on the other question you referenced</a>, this site can be a resource for \"anybody\" to ask questions, whereas the specific sites like Physics, Unix &amp; Linux, SuperUser, Cooking, etc are better suited to <em>experts</em> on those particular topic, or people looking to become experts.</p>\n\n<blockquote>\n  <p>Put another way: If you want to know how something works, ask here. If you want the\n  mathematics behind a physical reaction or the scientific explanation of something, \n  ask on <a href=\"http://physics.stackexchange.com\">http://physics.stackexchange.com</a>.</p>\n  \n  <p>Put in a simpler way: I think the\n  target audience of this site should be\n  the \"everyman\". If you have a question\n  about how something works that the\n  everyday person might ask or want to\n  read the answer to, ask on here. If\n  you're a scientist or want a\n  scientific explanation which would be\n  too in-depth and above the average\n  person's level of interest, ask on\n  physics.stackexchange.com</p>\n</blockquote>\n\n<p><strong>Here's some example questions to show what I mean:</strong></p>\n\n<ul>\n<li><p><strong>\"How does a convection oven work?\"</strong></p>\n\n<p>Good for HTW.stackexchange.com...</p></li>\n<li><p><strong>\"How does a convection oven change the way my food is cooked and what do I need to do differently when cooking food in a convection oven?\"</strong></p>\n\n<p>Good for cooking.stackexchange.com.</p></li>\n<li><p><strong>\"How do Anti Lock Brakes work?\"</strong></p>\n\n<p>Good for HTW.stackexchange.com...</p></li>\n<li><p><strong>\"What is the difference in the coefficient of friction when Anti-Lock brakes are used in the following scenario?\"</strong></p>\n\n<p>Good for physics.stackexchange.com.</p></li>\n<li><p><strong>\"How does OpenID work?\"</strong></p>\n\n<p>Good for HTW.stackexchange.com...</p></li>\n<li><p><strong>\"How does OpenID transmit data securely? What encryption is used?\"</strong></p>\n\n<p>Good for superuser.com.</p></li>\n</ul>\n\n<p>I am not sure if the distinction is as clear to others as it is to me... comment and let me know!</p>\n\n<p>I am not sure if people agree or not -- up/down vote me!</p>\n", "OwnerUserId": 20, "LastEditorUserId": 20, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T16:45:58.000", "LastActivityDate": "2011-04-19T16:45:58.000", "CommentCount": 1}
{"Id": 32, "PostTypeId": 2, "ParentId": 30, "CreationDate": "2011-04-19T17:07:26.530", "Score": 0, "ViewCount": 0, "Body": "<p>As Josh said the subjects might over lap, but different questions and wording really decide where it should go. Take these examples: There are sites for ubuntu linux, unix/linux and Serverfault/superuser and here.</p>\n\n<blockquote>\n  <p>What is unity in Ubuntu?</p>\n</blockquote>\n\n<p>This would be for ubuntu because it is specific to only ubuntu.</p>\n\n<blockquote>\n  <p>How does a monolithic kernel work?</p>\n</blockquote>\n\n<p>While valid in the Unix/Linux FAQ it is better here</p>\n\n<blockquote>\n  <p>What are Crons and how do I set one?</p>\n</blockquote>\n\n<p>This would be better for Unix because it covers nearly all distributions of Linux/Unix.</p>\n\n<p>See how all those questions are about Unix/Linux but certain ones belong to different sites, depending on how the user asks, and what there looking for.</p>\n", "OwnerUserId": 28, "LastEditorUserId": 28, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T17:19:17.923", "LastActivityDate": "2011-04-19T17:19:17.923"}
{"Id": 33, "PostTypeId": 1, "CreationDate": "2011-04-19T17:28:22.690", "Score": 7, "ViewCount": 75, "Body": "<p>The sites name is how do <strong>things</strong> work, but how literally do we want to take that. Do we want to stay concrete and explain only physical objects working, or do we want to consider it figuratively? For example, I asked how does multi-wavelength fiber works, this works because fiber is an object. Now, I could ask how the conjugation of German verbs work. I'm asking how something works, but it's not a object in the concrete sense. If we went figuratively it would be on topic.  So are we considering non physical things like my example to be on topic? </p>\n", "OwnerUserId": 28, "LastEditorUserId": 42, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T23:21:45.187", "LastActivityDate": "2011-04-19T23:48:35.923", "Title": "What are \"Things\" (in context of the FAQ)?", "Tags": ["discussion", "featured"], "AnswerCount": 2, "CommentCount": 3, "FavoriteCount": 4}
{"Id": 34, "PostTypeId": 1, "CreationDate": "2011-04-19T17:30:59.287", "Score": 2, "ViewCount": 38, "Body": "<p><a href=\"http://htw.stackexchange.com/questions/170/how-is-money-created\">This question</a> was closed because \"you could probably write an entire economics textbook on the subject\". But I don't see any question on HTW that wouldn't worth a book or a library.</p>\n\n<p>So, is HTW more about pathes to answer or complete answers?</p>\n", "OwnerUserId": 128, "LastEditorUserId": 128, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T17:36:16.550", "LastActivityDate": "2011-04-19T18:11:00.843", "Title": "Isn't HTW more about pathes to answer than complete answers?", "Tags": ["discussion", "close-reasons"], "AnswerCount": 1}
{"Id": 36, "PostTypeId": 2, "ParentId": 34, "CreationDate": "2011-04-19T17:56:51.423", "Score": 4, "ViewCount": 0, "Body": "<p>True, you could write a book on <em>anything</em>... But you don't necessarily need to <em>read</em> a book to get the answer you're looking for. I can probably get a satisfactory answer to \"How does a toaster oven work?\" without reading pages of formula on kinetic theory...</p>\n\n<p>However, the myriad monetary systems that exist or have existed are not a toaster oven. Economics isn't a natural science. The laws governing the value of money are the constructs of humanity, and as variable as humanity itself. This makes giving a universally-applicable answer... <em>difficult</em>.</p>\n\n<p>But I doubt the author of that question <em>really</em> wanted an in-depth study on current theories of monetary economics - he probably just wanted a reasonably accurate summary of how monetary value is maintained in whatever system he happens to be a part of. If that's even on-topic here (and as I said, it <em>should be debated</em>), it must be specific - to twist my toaster oven example, would you <em>really</em> want to answer, \"How does heat work?\" when the asker really just wanted to know how his toast gets nice and brown in the morning?</p>\n", "OwnerUserId": 81, "LastEditorUserId": 81, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T18:11:00.843", "LastActivityDate": "2011-04-19T18:11:00.843", "CommentCount": 6}
{"Id": 37, "PostTypeId": 2, "ParentId": 33, "CreationDate": "2011-04-19T18:37:08.143", "Score": 4, "ViewCount": 0, "Body": "<p>My interpretation is that \"thing\" refers to physical objects. More specifically, I think what's on-topic at this site is the <em>function</em> of <em>everyday</em> physical objects and the technology behind them.</p>\n\n<p>I think that there should be a focus on technology and physical objects to avoid the scope of the site becoming too broad... i.e. the \"How does money work\" question, or things like \"How do social structures work?\". I envision a site describing how the world and the objects we relate to every day work, as opposed to concepts about society, politics, economics, etc.</p>\n\n<p>In my experience a more narrow focus makes for a better StackExchange site.</p>\n\n<p>Downvote to disagree!</p>\n", "OwnerUserId": 20, "LastActivityDate": "2011-04-19T18:37:08.143", "CommentCount": 4}
{"Id": 38, "PostTypeId": 2, "ParentId": 26, "CreationDate": "2011-04-19T18:48:09.880", "Score": 0, "ViewCount": 0, "Body": "<p>I think there is a level at which questions should not be asked here. This question in particular reaches that level, in my mind.</p>\n\n<p><a href=\"http://htw.stackexchange.com/questions/205/how-does-gravity-work\">How Does Gravity Work?</a></p>\n\n<p>I think that goes to the level that it's really difficult to explain. One key phrase in the asker's question is \"I've done physics up to second year university but still never really understood how gravity works.\" It seems to me that this one should be migrated...</p>\n", "OwnerUserId": 67, "LastActivityDate": "2011-04-19T18:48:09.880"}
{"Id": 39, "PostTypeId": 2, "ParentId": 26, "CreationDate": "2011-04-19T18:59:39.943", "Score": 1, "ViewCount": 0, "Body": "<p>There is a drive on meta.physics to try and raise the level of question. Some seem to want it raised to the extent that every answer must reference a <em>phys rev letters</em> paper.</p>\n\n<p>'how it works' could fulfill a useful role as a physics-for-dummies (meant in a good way - I love the for dummies books!)</p>\n", "OwnerUserId": 15, "LastActivityDate": "2011-04-19T18:59:39.943"}
{"Id": 40, "PostTypeId": 2, "ParentId": 33, "CreationDate": "2011-04-19T20:38:26.083", "Score": 2, "ViewCount": 0, "Body": "<p>I have mixed feelings. While clearly \"how does government work?\" is too broad, probably \"How does the International Court enforce it's decisions?\" could be on-topic. The International Court is a <em>thing</em>, and <em>man-made</em>. It's <em>an artifact</em>. It has <em>functions</em>. </p>\n\n<p>I think we can wait a while to restrict the site's scope, and see what kind and quality of questions and answers we are able to produce.  </p>\n\n<p>I am afraid we are too exposed to easy Wikipedia-one-shot Q&amp;A related to everyday things, as you can see just skimming the current 81 questions posted in the site.  </p>\n\n<p>Let's wait and see. We may use downvotes to gain consensus, instead of closing.</p>\n\n<p>Just my 2 cents.  </p>\n\n<p>** Edit **  </p>\n\n<p>This is I what I understand will happen when you restrict the scope to just mechanisms/everyday things. Just a quick browse along the questions so far (Please, understand that I am not criticizing the questions, but trying to improve the site) :  </p>\n\n<p>How does a flatbed scanner work? \n<a href=\"http://en.wikipedia.org/wiki/Image_scanner#Flatbed\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Image_scanner#Flatbed</a></p>\n\n<p>How does a microwave oven work?\n<a href=\"http://en.wikipedia.org/wiki/Microwave_oven\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Microwave_oven</a></p>\n\n<p>How do radio transmitters work?\n<a href=\"http://en.wikipedia.org/wiki/Radio_transmitter#How_it_works\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Radio_transmitter#How_it_works</a></p>\n\n<p>How does an antenna work?\n<a href=\"http://en.wikipedia.org/wiki/Antenna_%28radio%29\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Antenna_%28radio%29</a></p>\n\n<p>How do Dimmer switches work?\n<a href=\"http://en.wikipedia.org/wiki/Dimmer\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Dimmer</a></p>\n\n<p>How does an electric stove work?\n<a href=\"http://en.wikipedia.org/wiki/Electric_stove\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Electric_stove</a></p>\n\n<p>How do Traction Control Systems work?\n<a href=\"http://en.wikipedia.org/wiki/Traction_Control_System\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Traction_Control_System</a></p>\n\n<p>How does an oil refinery work?\n<a href=\"http://en.wikipedia.org/wiki/Oil_refinery\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Oil_refinery</a></p>\n\n<p>Etc. Etc.</p>\n\n<p>So ... what value are we adding? Why restrict the scope NOW, instead of exploring first what kind of good content we could produce? </p>\n", "OwnerUserId": 27, "LastEditorUserId": 27, "LastEditorDisplayName": "", "LastEditDate": "2011-04-19T23:48:35.923", "LastActivityDate": "2011-04-19T23:48:35.923", "CommentCount": 7}
{"Id": 41, "PostTypeId": 1, "CreationDate": "2011-04-20T01:09:11.583", "Score": 7, "ViewCount": 51, "Body": "<p>Most of the questions that I've seen so far on this site can be answered by a short search on either Wikipedia or Google, and in fact many of them are. How are we going to make this site different, or are we content to be a poor cousin to Wikipedia?</p>\n", "OwnerUserId": 142, "LastActivityDate": "2011-04-20T03:10:48.043", "Title": "How do we offer something different from Wikipedia?", "Tags": ["discussion"], "AnswerCount": 1, "CommentCount": 2, "FavoriteCount": 1}
{"Id": 42, "PostTypeId": 2, "ParentId": 4, "CreationDate": "2011-04-20T02:01:50.213", "Score": 1, "ViewCount": 0, "Body": "<p>The <em>How Things Work</em> site may indeed be pushing the limits of what a Stack Exchange can effectively provide.  The questions appropriate to this site seem to be fairly general and of a large-scale and indefinite nature, contrasting with say Stack Overflow where most questions are pretty narrow and much less likely to have been already reasonably addressed somewhere on the internet. </p>\n\n<p>That may mean that this site is superfluous, but it could be that this site will turn out to be useful in a slightly different way than most Stack Exchange sites.  Perhaps the typical good answer here will be short, to the questioner's point, and less detailed than other SE sites, and then have links to places like How Stuff Works or WP.  Certainly WP can be too detailed and at times hard to match to a question, and since HSW is canned, it is not going to be responsive either.  A danger here is that we simply provide a reading and restatement service for the lazy searcher.  Nevertheless, the SE community approach may prove to be useful in this arena.</p>\n", "OwnerUserId": 139, "LastActivityDate": "2011-04-20T02:01:50.213", "CommentCount": 2}
{"Id": 43, "PostTypeId": 1, "CreationDate": "2011-04-20T02:53:29.127", "Score": 21, "ViewCount": 145, "Body": "<p>I love it! It's going to be great. This Stack Exchange has the potential to be monumentally awesome. I love the idea of hundreds of detailed, wikipedia-style, community-edited explanations of how things actually work. With pictures WE took or drew. With knowledge from OUR heads.</p>\n\n<p>But I might have to kill it.</p>\n\n<p>Why?</p>\n\n<ul>\n<li><p>I might have to kill it if the community decides that it's OK to <a href=\"http://htw.stackexchange.com/questions/1/how-can-blu-ray-discs-store-a-huge-amount-of-data/17#17\">copy content</a> from howstuffworks.com. Fair use, shmair use. I'm not going to defend a copyright lawsuit to defend our right to cut and paste from another site.</p></li>\n<li><p>I might have to kill it if all we're doing here is posting links to any of the giant other repositories of \"how things work\" knowledge on the Internet. When you make a page like this:</p>\n\n<p>Q: How does a toaster work?<br>\nA: Wikipedia has a great explanation. </p>\n\n<p>... well, you just made the Internet a worse place. Why? Because if anyone lands on this page from a Google search, all we've done is delay them on their path to the real answer.</p></li>\n<li><p>I might have to kill it if it starts to smell like a content farm: a bunch of half-assed seventh grade \"research\" projects. I remember in seventh grade I did a research report on Florida. It was mostly just the World Book Encyclopedia entry on Florida, paraphrased by me. Barely acceptable for a twelve year old. Devastating to the Internet.</p></li>\n</ul>\n\n<p>Remember, our mission is to make the Internet a <em>better</em> place to get <em>expert</em> answers to your questions.</p>\n\n<p>What guidelines can we establish here to insure that the <strong>How Things Works</strong> Stack Exchange makes the Internet better?</p>\n", "OwnerUserId": 140, "LastActivityDate": "2011-04-21T22:53:34.303", "Title": "Please don't make me kill this site.", "Tags": ["discussion"], "AnswerCount": 4, "CommentCount": 4, "FavoriteCount": 7}
{"Id": 44, "PostTypeId": 2, "ParentId": 41, "CreationDate": "2011-04-20T03:03:39.763", "Score": 10, "ViewCount": 0, "Body": "<p>There may be a bit of a \"beta\" phenomenon here, where people are typing in a bunch of questions to \"get the site started,\" not because they really need the answer.</p>\n\n<p>Don't ask questions that are trivially answered by typing the same question in Google or Wikipedia. Just don't ask them in the first place.</p>\n\n<p>Over on <a href=\"http://english.stackexchange.com/\">english.stackexchange.com</a>, we are <a href=\"http://meta.english.stackexchange.com/questions/939/how-to-respond-to-dictionary-general-reference-questions\">experimenting</a> with a custom close reason called \"general reference\":</p>\n\n<p><img src=\"http://i.imgur.com/y3CAc.png\" alt=\"enter image description here\"></p>\n\n<p>We're going to make this available on htw. When you see a question, try a quick Google search on the title of the question. If there is a perfectly good answer in the first two or three results, or on Wikipedia or howstuffworks.com or similar, just close the question as \"general reference\". This can ensure that we're only creating answers where we have an opportunity to <em>make the internet better.</em></p>\n\n<p>Maybe this site should grow it's own answers to subtle, harder \"how things work\" situations where the Internet doesn't actually have an answer, or the canonical answer sources have a jumbled, incomprehensible mess that you can make better.</p>\n", "OwnerUserId": 140, "LastEditorUserId": 140, "LastEditorDisplayName": "", "LastEditDate": "2011-04-20T03:10:48.043", "LastActivityDate": "2011-04-20T03:10:48.043", "CommentCount": 8}
{"Id": 45, "PostTypeId": 2, "ParentId": 43, "CreationDate": "2011-04-20T03:41:29.283", "Score": 3, "ViewCount": 0, "Body": "<p>Firstly, I agree with a lot of what you said, at this point this site won't work.</p>\n\n<ul>\n<li><p>A fair number of people have copied diagrams from HowStuffWorks. I agree this is <strong>not</strong> ok, and we need to work on that. I think learning then applying from using other sources to bolster your answers is great, and I do it most of mine. I think a good counter to this practice is plain ol' voting.   </p></li>\n<li><p>I've seen exactly that in comments, and I don't like it. I like the idea of asking a question and getting a response to the question that I asked very specific to it, without reading a entire article that doesn't even touch on it.   I think this may happen because people see this as \"just another content site\" and don't want it to succeed. </p></li>\n<li><p>I see what you're saying here, and again I think it's caused because people don't want to see this place succeed or they don't understand how it should work. For example how I think we could avoid this , @josh asked how does DSL work, but then he asked more specifically about how certain parts work. I replied with how it worked, then covered what he specifically wanted to know about certain parts of why DSL worked. I think this is a good way of how Q and As here should flow.</p></li>\n</ul>\n\n<p>What in my opinion does this boil down too?</p>\n\n<ol>\n<li>We really need to work on what's allowed, We don't want how does the universe work or a basic question that 6 million people have already asked. </li>\n<li>We need to make this unique, it has to be worth it to come here vs Howstuffworks </li>\n<li>We need to stop blatant copying and linking as a answer only, and get people to write unique content. </li>\n</ol>\n\n<p>I used we in all of those statements because those are things the community <strong>needs</strong> to discuss and decide on. Otherwise this site will end up failing, and I don't want that to happen.</p>\n\n<p>As always please feel free to challenge or discuss what I've said, it is the <strong>only</strong> way to better this site.</p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-20T03:41:29.283", "CommentCount": 3}
{"Id": 46, "PostTypeId": 1, "CreationDate": "2011-04-20T09:33:05.913", "Score": 0, "ViewCount": 39, "Body": "<p>Let's try to sort ideas in this thread.</p>\n\n<p>So people can up-down vote criteria and speak (shortly) about them in comments.</p>\n\n<p>This is about <strong>criteria for an on/off-topic questions</strong>, not about example questions (this is not area51).</p>\n\n<p>The final use could be the faq.</p>\n\n<ul>\n<li>One criteria per answer (keep it simple)</li>\n<li>No explanation (the criteria alone should be enough, discuss it in the comments)</li>\n<li>If you want/need to add example question, at least two example on-topic and two example off-topic (to \"prove\" it is useful to begin to generalize a rule and that yours is not well defined as you need examples)</li>\n</ul>\n\n<p>Don't vote for example, but for criteria. \n(Reminder: down-voting on meta doesn't affect your or the other's reputation)</p>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T13:34:39.610", "ClosedDate": "2011-04-20T13:51:20.033", "Title": "Criteria for an on/off-topic question", "Tags": ["discussion", "poll"], "AnswerCount": 4, "CommentCount": 3}
{"Id": 47, "PostTypeId": 1, "CreationDate": "2011-04-20T09:34:43.790", "Score": 1, "ViewCount": 41, "Body": "<p>Let's try to sort ideas in this thread.</p>\n\n<p>So people can up-down vote criteria and speak (shortly) about them in comments.</p>\n\n<p>This is about <strong>criteria for a good answer</strong>, what should it be, even if the final acceptor is the asker.</p>\n\n<p>The final use could be the faq.</p>\n\n<ul>\n<li>One criteria per answer</li>\n<li>Maximum two lines of explanation (the criteria alone should be enough, discuss it in the comments or if the topic is hot, make a more precise question about it)</li>\n<li>Links to questions as examples.</li>\n</ul>\n\n<p>Don't vote for example, but for criteria. \n(Reminder: down-voting on meta doesn't affect your or the other's reputation)</p>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T13:39:53.660", "ClosedDate": "2011-04-20T13:52:28.287", "Title": "Criteria for an acceptable answer", "Tags": ["discussion", "poll"], "AnswerCount": 8, "CommentCount": 1}
{"Id": 51, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T09:42:58.040", "Score": 2, "ViewCount": 0, "Body": "<h2>original work, not a copy-paste</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:42:58.040", "CommunityOwnedDate": "2011-04-20T13:42:50.363", "CommentCount": 1}
{"Id": 52, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T09:44:07.383", "Score": 2, "ViewCount": 0, "Body": "<h2>not a simple link</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:44:07.383", "CommunityOwnedDate": "2011-04-20T13:42:33.203", "CommentCount": 1}
{"Id": 53, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T09:44:25.230", "Score": -2, "ViewCount": 0, "Body": "<h2>100-200 words maximum</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:44:25.230", "CommunityOwnedDate": "2011-04-20T13:43:40.253", "CommentCount": 2}
{"Id": 54, "PostTypeId": 2, "ParentId": 46, "CreationDate": "2011-04-20T09:48:32.923", "Score": 0, "ViewCount": 0, "Body": "<h2>about material thing (unrestrictive)</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:48:32.923", "CommunityOwnedDate": "2011-04-20T13:40:35.577", "CommentCount": 1}
{"Id": 55, "PostTypeId": 2, "ParentId": 46, "CreationDate": "2011-04-20T09:49:59.083", "Score": 0, "ViewCount": 0, "Body": "<h2>about univocal concept (unrestrictive)</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:49:59.083", "CommunityOwnedDate": "2011-04-20T13:40:18.727"}
{"Id": 56, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T09:52:56.007", "Score": 2, "ViewCount": 0, "Body": "<h2>not only a summary</h2>\n\n<p>added value is needed</p>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T09:52:56.007", "CommunityOwnedDate": "2011-04-20T13:42:17.073", "CommentCount": 3}
{"Id": 58, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T12:36:35.627", "Score": -2, "ViewCount": 0, "Body": "<h2>maximum 100-200 words recommendation</h2>\n", "OwnerUserId": 128, "LastEditorUserId": 128, "LastEditorDisplayName": "", "LastEditDate": "2011-04-20T13:05:05.373", "LastActivityDate": "2011-04-20T13:05:05.373", "CommunityOwnedDate": "2011-04-20T13:44:27.743", "CommentCount": 4}
{"Id": 59, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T12:37:32.550", "Score": 0, "ViewCount": 0, "Body": "<h2>not an encyclopedia article</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T12:37:32.550", "CommunityOwnedDate": "2011-04-20T13:41:29.523", "CommentCount": 1}
{"Id": 60, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T12:59:44.020", "Score": 0, "ViewCount": 0, "Body": "<h2>understandable without previous knowledge in the domain</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T12:59:44.020", "CommunityOwnedDate": "2011-04-20T13:41:50.270"}
{"Id": 61, "PostTypeId": 2, "ParentId": 46, "CreationDate": "2011-04-20T13:00:35.080", "Score": 0, "ViewCount": 0, "Body": "<h2>understandable without previous knowledge in the domain</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T13:00:35.080", "CommunityOwnedDate": "2011-04-20T13:47:01.157"}
{"Id": 62, "PostTypeId": 2, "ParentId": 46, "CreationDate": "2011-04-20T13:29:48.940", "Score": 0, "ViewCount": 0, "Body": "<h2>title must have the format \"How [XXX] work?\"</h2>\n", "OwnerUserId": 128, "LastActivityDate": "2011-04-20T13:29:48.940", "CommunityOwnedDate": "2011-04-20T13:47:30.047", "CommentCount": 1}
{"Id": 64, "PostTypeId": 2, "ParentId": 47, "CreationDate": "2011-04-20T13:39:53.660", "Score": 0, "ViewCount": 0, "Body": "<h2>Specific, to-the-point answers</h2>\n\n<p>Answers should be as specific as possible. They should not be long overviews of how a particular thing works, but should address <em>the specific question</em> and only the function as it relates to.</p>\n", "OwnerUserId": 20, "LastActivityDate": "2011-04-20T13:39:53.660", "CommunityOwnedDate": "2011-04-20T13:40:03.657"}
{"Id": 65, "PostTypeId": 1, "AcceptedAnswerId": 70, "CreationDate": "2011-04-20T15:58:12.720", "Score": 2, "ViewCount": 40, "Body": "<p>Specifically, are we allowed to use images from Wikipedia, or other similar sites? Or do they all have to be of our own creation? Thanks!</p>\n", "OwnerUserId": 67, "LastActivityDate": "2011-04-20T22:35:41.757", "Title": "Where are we allowed to use images from?", "Tags": ["discussion", "copyright"], "AnswerCount": 3}
{"Id": 66, "PostTypeId": 2, "ParentId": 65, "CreationDate": "2011-04-20T16:08:24.273", "Score": -3, "ViewCount": 0, "Body": "<p>Everything on wikipedia is Creative commons, you are allowed to just use it.</p>\n\n<p>Other images you could use with attribution - add a line say by who and where it was from.</p>\n\n<p>The rules on this differ from country to country but it would probably be safe to use an image from a manufacture's site of their own product, or an image from an academic or research group page.</p>\n", "OwnerUserId": 15, "LastActivityDate": "2011-04-20T16:08:24.273", "CommentCount": 2}
{"Id": 67, "PostTypeId": 2, "ParentId": 65, "CreationDate": "2011-04-20T16:36:50.867", "Score": 2, "ViewCount": 0, "Body": "<p>None or as few as possible. Joel Splosky said <a href=\"http://meta.htw.stackexchange.com/questions/43/please-dont-make-me-kill-this-site\">here</a> that </p>\n\n<blockquote>\n  <p>With pictures WE took or drew</p>\n</blockquote>\n\n<p>and</p>\n\n<blockquote>\n  <p>I might have to kill it if the community decides that it's OK to copy content from howstuffworks.com. Fair use, shmair use. I'm not going to defend a copyright lawsuit to defend our right to cut and paste from another site.</p>\n</blockquote>\n\n<p>I think this is also to differentiate ourselves from other places. I think we should try to make our own diagram if possible, but <em>I think</em> we can use wikipedia as long as we source it.   </p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-20T16:36:50.867", "CommentCount": 3}
{"Id": 68, "PostTypeId": 2, "ParentId": 43, "CreationDate": "2011-04-20T16:39:39.487", "Score": 4, "ViewCount": 0, "Body": "<p>I'm going to flag/edit every picture that I see that has a image copied that looks like it's copyrighted.</p>\n\n<p>I suggest that every else do the same.</p>\n", "OwnerUserId": 67, "LastActivityDate": "2011-04-20T16:39:39.487"}
{"Id": 69, "PostTypeId": 2, "ParentId": 43, "CreationDate": "2011-04-20T21:48:43.363", "Score": 8, "ViewCount": 0, "Body": "<blockquote>\n  <h1>Summary:</h1>\n  \n  <h2>I think we need to ask <em>very specific questions</em></h2>\n  \n  <h3>That way, we provide a resource which HowStuffWorks or Wikipedia can not</h3>\n</blockquote>\n\n<h1>TL;DR complete answer:</h1>\n\n<hr>\n\n<p>I agree with the concerns Joel mentioned. First and foremost, <strong>we cannot have copyright infringement!!!</strong> <a href=\"http://www.howstuffworks.com/\" rel=\"nofollow\">howstuffworks.com</a> is not an open and free encyclopedia like Wikipedia and copying articles verbatim or reusing their images will not only get Stack Exchange in trouble but <em>it is a terrible reflection on our community and our users</em>.</p>\n\n<p>However the point goes beyond that alone. <strong>This is a much bigger question than just \"how do we not be HowStuffWorks.com\"</strong> As Joel said, <em>we don't want to copy from or simply link to Wikipedia either</em>, even if copyright isn't a concern. I've been thinking about this a lot since reading Joel's posts, because I have a strong gut feeling that this can be a truly awesome Stack Exchange site, and I was trying to reconcile my feeling with some logical conclusions...</p>\n\n<p>I have said in answers and comments that it would be fine to ask questions which have large overlap with Wikipedia. I never meant to imply that it was okay to simply copy from Wikipedia, but as a counter-argument to someone who said that <a href=\"http://htw.stackexchange.com/\">htw.stackexchange.com</a> was pointless and would just end up mirroring <a href=\"http://www.howstuffworks.com/\" rel=\"nofollow\">howstuffworks.com</a> or Wikipedia, I did say, </p>\n\n<blockquote>\n  <p>Why even have this site when others like it exist? Because if you're not a Stack Exchange site than you're doing it wrong!!! StackExchgange FTW!</p>\n</blockquote>\n\n<p>Clearly that was a playful comment, but at the same time <strong>it's so much more</strong>. I truly believe in the Stack Exchange model, and I do believe that this site has a genuine purpose even when we also have Wikipedia. So I tried to think about <em>what it was specifically</em> that makes me love Stack Exchange sites more than Wikipedia.</p>\n\n<ol>\n<li><p><strong>It's the voting system</strong></p>\n\n<p>I've been using the internet since before some of our users were born. I've been programming for even longer than that. So I've been asking people for help with programming problems for <em>a long time</em>, and <em>nowhere</em> have I found better answers than StackOverflow. Plus, SO gives better answers <em>faster</em> than anywhere else. And the same thing goes for ServerFault, SuperUser, and just about all the SE sites I use. The voting system makes the cream rise to the top. But it's more than that alone...</p></li>\n<li><p><strong>It's the reputation system</strong></p>\n\n<p>In the \"dark days\" of the internet before Stack Exchange, on forums, listservs and BBS systems before those, there just wasn't that much incentive to put time and effort into helping people. The reputation system changes that, it makes people strive to take ownership of the site and really help each other by answering questions, editing questions, and building the best site possible. But, Wikipedia does an amazingly good job of being collaboratively edited with no reputation system...</p></li>\n<li><p><strong>It's the <em>community</em></strong></p>\n\n<p>You can't ask Wikipedia anything. I'm sure the editors and authors for Wikipedia have a sense of community and chat or talk amongst themselves somehow, but to me (and I assume a majority of others) <em>wikipedia is an encyclopedia, and not a community</em>. Having used StackOverflow from before SuperUser or ServerFault even existed, I can say I am <strong>overwhelmed</strong> at how the experience has changed in the past year. Chat has a <em>giant</em> part to do with this. Maybe I'm just biased because I'm the #2 chat user on Meta, but, I think that chat has really made this place a great community of users.</p></li>\n</ol>\n\n<h3>So what does this mean?</h3>\n\n<p>What it means to me is that we need to put our strengths to use. Since we're a community and not just an encyclopedia, we have strengths Wikipedia doesn't. We can ask each other for much more analytical and in-depth knowledge that sure, maybe Wikipedia <em>has</em> but a <em>human being</em> has to gather from a wikipedia article and assimilate.</p>\n\n<p><strong>I think that this site can really excel with very specific, long-tail questions</strong>. </p>\n\n<blockquote>\n  <p>How does <em>x</em> work?</p>\n</blockquote>\n\n<p>Can just be explained by reading the entire Wikipedia article. But if we start to ask,</p>\n\n<blockquote>\n  <p>How does <em>x</em> do <em>y</em>?</p>\n</blockquote>\n\n<p>or </p>\n\n<blockquote>\n  <p>Why is <em>x</em> better at <em>y</em> than <em>z</em>?</p>\n</blockquote>\n\n<p>We're now asking for specific information which maybe is in the Wikipedia article, but you'd need to read the entire article to find the specific part. It's like on StackOverflow, if you ask a specific question, you get specific answers. But if you just ask \"How do I make code which does <em>x?</em>\" you get closed.</p>\n\n<p>Questions should be extremely specific, and not ask for an overview of how an entire thing or technology works; instead, questions should be long-tailed and ask how one particular part of a thing or technology works.</p>\n\n<p><strong>Here's some good, specific question examples:</strong></p>\n\n<ul>\n<li><a href=\"http://htw.stackexchange.com/q/152/20\">How do trolleybuses switch power lines</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/10/20\">How does a traffic signal detect when a vehicle is at the intersection?</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/11/20\">How does a gasoline pump know when the tank is full?</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/20/20\">How does a purely electrical car (like the Tesla Roadster) get away with having no transmission?</a></li>\n<li><a href=\"http://htw.stackexchange.com/questions/264/how-can-isps-get-more-speed-out-of-cable-internet-service/269#269\">How can ISPs get more speed out of cable internet service?</a></li>\n</ul>\n\n<p>The first example is not just \"How does a trolley work?\" but rather it's asking about a <em>very specific problem</em>. Trolley or traffic signals or cars are complicated machines... asking about a specific thing is much easier than reading an entire article on everything about them just for one piece of information.</p>\n\n<p><strong>Compare the above to these much broader questions:</strong></p>\n\n<ul>\n<li><a href=\"http://htw.stackexchange.com/q/148/20\">How does a nuclear reactor work?</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/202/20\">How does a microwave oven work?</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/206/20\">How does a flatbed scanner work?</a></li>\n<li><a href=\"http://htw.stackexchange.com/q/8/20\">How does a Flash Drive work?</a></li>\n</ul>\n\n<p>I'm not saying these are bad questions. <strong>I'm just saying these are the kind of questions which can get us into trouble</strong>. \"How does a nuclear reactor work?\" is <strong>so broad</strong> that you really are better off reading the entire Wikipedia article. It would be like asking on StackOverflow \"How does Facebook work?\" -- it'll get closed in an instant. But if you ask about a specific part of Facebook, you're likely to get a specific and very interesting answer.</p>\n", "OwnerUserId": 20, "LastEditorUserId": 20, "LastEditorDisplayName": "", "LastEditDate": "2011-04-20T21:55:38.520", "LastActivityDate": "2011-04-20T21:55:38.520", "CommentCount": 6}
{"Id": 70, "PostTypeId": 2, "ParentId": 65, "CreationDate": "2011-04-20T22:35:41.757", "Score": 5, "ViewCount": 0, "Body": "<p>Please honor copyright scrupulously. If you don't know the source of an image, assume that you can't use it. Many images on Wikipedia include detailed information about their license and may be legal to use; if so please copy the license information or at least link back to it so that others can be certain that the image can be use legally.</p>\n", "OwnerUserId": 140, "LastActivityDate": "2011-04-20T22:35:41.757"}
{"Id": 71, "PostTypeId": 1, "CreationDate": "2011-04-21T02:39:13.653", "Score": 2, "ViewCount": 11, "Body": "<p>Over at <a href=\"http://meta.htw.stackexchange.com/questions/33/what-are-things-in-context-of-the-faq\">What is a thing</a> we discussed what is on topic for How Things Work. I think we should start discussing how questions should be formatted, and what constitutes a great question. Also, by defining a good question criteria we should be able to extrapolate bad criteria.  I'll post my thoughts as an answer to keep the question neutral.  </p>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-21T02:51:39.523", "Title": "What constitutes a great question?", "Tags": ["discussion", "asking-questions"], "AnswerCount": 1}
{"Id": 72, "PostTypeId": 2, "ParentId": 71, "CreationDate": "2011-04-21T02:51:39.523", "Score": 1, "ViewCount": 0, "Body": "<p>What makes a good question in my opinion?</p>\n\n<ul>\n<li>Needs to be about an object not about a concept.</li>\n<li>Has to be focused around how something works or asking how 2 things work and comparing them</li>\n<li>Shouldn't be easy to find in a google search/article, there needs to be a reason why you asked it here.</li>\n<li>Should allow for a rich and deep explanation.</li>\n</ul>\n\n<p>So do we have any examples of good questions currently? Yes, we do and here's why I think they're good.</p>\n\n<ol>\n<li><a href=\"http://htw.stackexchange.com/questions/220/how-does-dsl-encode-data-and-achieve-such-greater-bandwidth-than-dialup\">How does DSL encode data and achieve such greater bandwidth than dialup?</a>  Josh didn't just ask how DSL worked, but branched off so that you couldn't find it in a search.</li>\n<li><a href=\"http://htw.stackexchange.com/questions/225/why-is-an-aerospike-more-effecient-than-a-bell-nozzle\">Why is an aerospike more effecient than a bell nozzle?</a>  I like this one because it is comparing/contrasting 2 objects and asking how they work. Again you're most likely not going to easily google fu this.</li>\n</ol>\n", "OwnerUserId": 28, "LastActivityDate": "2011-04-21T02:51:39.523"}
{"Id": 73, "PostTypeId": 2, "ParentId": 26, "CreationDate": "2011-04-21T13:08:52.570", "Score": 0, "ViewCount": 0, "Body": "<p>I think the difference is how it is answered. If I understand it right, the physics site is more about the science which can be very complex. A lot of people will be interested in a question about a physical phenomena, but will not want to try to understand a scientific answer. </p>\n\n<p>This site can give a simpler answer that might not be as accurate as a scientific answer, but good enough to understand the main issue.</p>\n", "OwnerUserId": 40, "LastActivityDate": "2011-04-21T13:08:52.570"}
{"Id": 74, "PostTypeId": 2, "ParentId": 30, "CreationDate": "2011-04-21T13:12:04.597", "Score": 0, "ViewCount": 0, "Body": "<p>Why is overlap a problem. You can have questions that can be answered targeted to a difference audience. For some people specialized sites might give answers that are to details, to specialized, and do not meet the needs of the person who is looking for an answer.</p>\n\n<p>I believe it can be good to have differently targeted answers on different site even if the questions are the same.</p>\n", "OwnerUserId": 40, "LastActivityDate": "2011-04-21T13:12:04.597"}
{"Id": 75, "PostTypeId": 1, "CreationDate": "2011-04-21T13:45:42.777", "Score": -1, "ViewCount": 55, "Body": "<p>A user has been answering a lot of questions. In one particular case, his answer was factually incorrect in several places, poorly worded, poorly spelt and poorly referenced. I began to edit his post but ended in answering the question again separately because there was too much to change - I did also comment on his own response but it's already been accepted by the original question asker, so at least one person has accepted an incorrect reply (which is what worried me initially).</p>\n\n<p>He's also answered other questions seemingly without verifying the information he's posting and is in danger of promulgating incorrect information and watering down the accuracy of the knowledge on HTW. How can we best gently remind him to double- and triple-check his answers prior to submitting them?</p>\n\n<p>I don't wish to come down too hard on him as the kid's apparently only 15 - if he went and answered every question with \"almost-right\" information in a science exam he'd be rightly marked down so I don't see why he should be given leeway to do the same on here.</p>\n", "OwnerUserId": 129, "LastEditorUserId": 42, "LastEditorDisplayName": "", "LastEditDate": "2011-04-22T15:09:44.963", "LastActivityDate": "2011-04-22T17:31:15.287", "Title": "How to deal with a user with poor quality answers?", "Tags": ["discussion", "users", "quality"], "AnswerCount": 1, "CommentCount": 4}
{"Id": 76, "PostTypeId": 2, "ParentId": 75, "CreationDate": "2011-04-21T14:37:48.843", "Score": 3, "ViewCount": 0, "Body": "<p>If you have found a user who is a serious problem, for example they are being offensive or posting hateful or damaging content, or SPAM, then posting here to bring attention to the team so that they can handle it may be appropriate, though  you should first flag for moderator attention and leave a detailed description of the problem there.</p>\n\n<p>But in general, the answer to \"How to deal with a user with poor quality answers?\" is <em>the same way as on any other Stack Exchange site:</em></p>\n\n<ol>\n<li>Downvote bad questions or incorrect answers.</li>\n<li>Comment on bad posts with why they're bad.</li>\n<li>Edit bad posts to correct them</li>\n<li>Flag seriously low quality posts for moderator attention</li>\n</ol>\n\n<p>And the community will take care of it.</p>\n", "OwnerUserId": 20, "LastEditorUserId": 81, "LastEditorDisplayName": "", "LastEditDate": "2011-04-22T17:31:15.287", "LastActivityDate": "2011-04-22T17:31:15.287", "CommentCount": 1}
{"Id": 78, "PostTypeId": 2, "ParentId": 43, "CreationDate": "2011-04-21T22:53:34.303", "Score": 1, "ViewCount": 0, "Body": "<p>I think that a vital part of this sites success is going to be the following element which is mentioned in the StackExchange FAQ on many a site:</p>\n\n<blockquote>\n  <p>It’s also perfectly fine to ask and answer your own question, as long as you pretend you’re on Jeopardy: phrase it in the form of a question.</p>\n</blockquote>\n\n<p>I think that it would be helpful if folks would ask questions that they <em>know</em> the answers to so that they can go ahead give a solid answer. At least for the private beta, so we can get a solid foundation here. </p>\n\n<p>Additionally, citations are important here. While copying and pasting content from others is wrong and lowers the quality of the site, providing factual information requires some sort of backing.</p>\n\n<p>This site is only going to succeed if it is heavily defined by the beta participants. We need to lead by example.</p>\n", "OwnerUserId": 165, "LastActivityDate": "2011-04-21T22:53:34.303"}
{"Id": 79, "PostTypeId": 1, "CreationDate": "2011-04-24T04:22:42.177", "Score": 1, "ViewCount": 32, "Body": "<p>Please, please, please, can the icon for this site be a magnet?</p>\n", "OwnerUserId": 172, "LastEditorUserId": 78, "LastEditorDisplayName": "", "LastEditDate": "2011-04-25T01:01:03.610", "LastActivityDate": "2011-04-25T01:01:03.610", "ClosedDate": "2011-04-25T13:37:33.713", "Title": "The Only Thing I Want in the World", "Tags": ["discussion", "icon"], "CommentCount": 2, "FavoriteCount": 2}
{"Id": 80, "PostTypeId": 1, "CreationDate": "2011-04-24T09:17:41.397", "Score": 3, "ViewCount": 17, "Body": "<p>It seems like the biggest problem facing \"how things work\" is identifying ways this site can <a href=\"http://meta.htw.stackexchange.com/questions/43/please-dont-make-me-kill-this-site\">actually</a> <a href=\"http://meta.htw.stackexchange.com/questions/26/concern-regarding-overlap-with-physics-se\">make</a> <a href=\"http://meta.htw.stackexchange.com/questions/71/what-constitutes-a-great-question\">the</a> <a href=\"http://meta.htw.stackexchange.com/questions/4/why-is-the-answer-to-most-questions-not-just-a-link-to-howstuffworks-com\">inter</a><a href=\"http://meta.htw.stackexchange.com/questions/33/what-are-things-in-context-of-the-faq\">net</a> <a href=\"http://meta.htw.stackexchange.com/questions/41/how-do-we-offer-something-different-from-wikipedia\">better</a> instead of just duplicating or linking to other, better sites--and slowing down users in the process as Joel put it so well.</p>\n\n<p>What I would like to see is a list of the good, solid questions which show \"how things work\" doing this.  Answers are good too, but the idea is that the whole package of what's happening demonstrates something that \"how things work\" does better than anyplace else. I don't know how to set this question up as the fancy wikified ones I've seen on other Stack Exchange meta's, but links with reasons and possibly relevant excerpts will do fine, or perhaps someone else can set it up.</p>\n\n<p>Are there tangible examples of \"how things work\" doing things right?  Let's see them!</p>\n", "OwnerUserId": 56, "LastActivityDate": "2011-04-24T09:17:41.397", "Title": "Examples of Best Questions (okay, I guess best answers too)?", "Tags": ["discussion", "questions", "best-of"], "CommentCount": 1, "FavoriteCount": 1}
{"Id": 81, "PostTypeId": 1, "CreationDate": "2011-04-24T16:43:51.630", "Score": 2, "ViewCount": 23, "Body": "<p><em>Prologue</em></p>\n\n<p>Well-I guess I've been fairly active on this site and provided quite a few answers here and there. And I enjoyed messing around here with my free time more than I do in other places such as SU... </p>\n\n<p><em>But is this going to last long?</em></p>\n\n<p>I've been to the atheism site during the beta and enjoyed the time while it lived... The problem with the site is that there are just so many question people could ask in a site- and it turns out that there are not so many!</p>\n\n<p>I hope that this site is not going to repeat many of the failed proposals... but then there are just not so many things in the world that its inner working is untrivial, interesting and is the question count going to plateau soon? I surely am worried... (Also see below)</p>\n\n<p>I don't have the hard numbers but from eyeballing it seems that question numbers has not been growing as fast as it has been... maybe some admin could tell us more about it... </p>\n\n<p><em>Hey, but one can ask for example thousands of untrivial question on how certain X work, in the field of Y...</em></p>\n\n<p>Yes- this site could for example turn into something that allows people to understand more on, for example, anything medically related- and perhaps, for example, I could help answer some of the question.... but this is not going to last very long as people do somehow get fed up when they (1) are real good at answering question, (2) spent too much time doing it... (I think some of our SU users would remember one of our moderator....)</p>\n\n<p>The problem is, trivial question, on one hand, can be answered by just about anybody, but some of them are too trivial, and there are not so many of them (or else everything would be so trivial... eh, everybody's a genius-) and difficult, professional questions, on the other hand, could only be answered by a small group of people, who may or may not come to our site- and thus my worry.</p>\n\n<p><em>And then the question is... what?</em></p>\n\n<ol>\n<li>How do we ensure that we have a never-ending supply of question? Broadening our scope? or something else? </li>\n<li>How do we distinguish this site from a simple google search // wikipedia search // etc?</li>\n</ol>\n\n<p><em>i know there are similar question but perhaps just let us take the survival problem here and discuss</em></p>\n", "OwnerUserId": 109, "LastActivityDate": "2011-04-25T20:49:50.217", "Title": "Is this site going to work very well in long-term?", "Tags": ["discussion", "asking-questions", "answers"], "AnswerCount": 2, "FavoriteCount": 2}
{"Id": 82, "PostTypeId": 1, "CreationDate": "2011-04-24T17:21:05.293", "Score": 0, "ViewCount": 14, "Body": "<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://meta.htw.stackexchange.com/questions/33/what-are-things-in-context-of-the-faq\">What are &ldquo;Things&rdquo; (in context of the FAQ)?</a>  </p>\n</blockquote>\n\n\n\n<p>Questions like (from the current first two on the front page):</p>\n\n<ul>\n<li><a href=\"http://htw.stackexchange.com/questions/359/how-do-clouds-fog-stay-up-in-the-air\">How do clouds/fog stay up in the air?</a></li>\n</ul>\n\n<p>and </p>\n\n<ul>\n<li><a href=\"http://htw.stackexchange.com/questions/298/how-does-a-master-key-work\">How does a master key work?</a></li>\n</ul>\n\n<p>seem very different. One is a topic of physical science, whereas the other is applied science or mechanics/engineering.</p>\n\n<p>Should this site cover both?  </p>\n", "OwnerUserId": 172, "LastActivityDate": "2011-04-24T17:21:05.293", "ClosedDate": "2011-04-25T13:33:57.133", "Title": "Does \"things\" include both inventions and the natural world?", "Tags": ["discussion", "topics"], "CommentCount": 3}
{"Id": 83, "PostTypeId": 1, "CreationDate": "2011-04-25T14:45:12.177", "Score": 0, "ViewCount": 9, "Body": "<p>This is half of one of the <a href=\"http://blog.stackoverflow.com/2010/07/the-7-essential-meta-questions-of-every-beta/\" rel=\"nofollow\">Seven Essential Questions for beta sites</a>:</p>\n\n<blockquote>\n  <p>5. What should our logo and site design look like?</p>\n</blockquote>\n\n<p>I'll leave the site design for another question, but let's address the logo here.</p>\n", "OwnerUserId": 172, "LastActivityDate": "2011-04-25T14:46:12.990", "Title": "What should our logo be?", "Tags": ["discussion", "seven-essential-questions", "logo", "site-design"], "AnswerCount": 1}
{"Id": 84, "PostTypeId": 2, "ParentId": 83, "CreationDate": "2011-04-25T14:46:12.990", "Score": 0, "ViewCount": 0, "Body": "<h2>The Only Thing I Want in the World:</h2>\n\n<p>Please, please, please, let's make the icon for this site be a magnet.</p>\n", "OwnerUserId": 172, "LastActivityDate": "2011-04-25T14:46:12.990"}
{"Id": 85, "PostTypeId": 2, "ParentId": 81, "CreationDate": "2011-04-25T19:29:46.650", "Score": 1, "ViewCount": 0, "Body": "<p>If I'm not mistaken, the original title for this proposed site was <strong>Popular Science</strong>. I personally think this was a far more appropriate name for this Q&amp;A site, because many questions that are perfect for \"Popular Science\" don't fit the <strong>How Things Work</strong> subject. At the same time, these question are too basic or uninteresting for the <strong>Physics</strong> stackexchange site.</p>\n\n<p>Although broadening the subject could improve things, to be honest I'm very pessimistic about the future of this site, because I haven't seen a single question that couldn't have been found in 2 minutes by doing a simple Google search.</p>\n", "OwnerUserId": 159, "LastActivityDate": "2011-04-25T19:29:46.650", "CommentCount": 2}
{"Id": 86, "PostTypeId": 2, "ParentId": 81, "CreationDate": "2011-04-25T20:49:50.217", "Score": 1, "ViewCount": 0, "Body": "<blockquote>\n  <p>The problem is, trivial question, on one hand, can be answered by just about anybody, but some of them are too trivial, and there are not so many of them (or else everything would be so trivial... eh, everybody's a genius-) and difficult, professional questions, on the other hand, could only be answered by a small group of people, who may or may not come to our site- and thus my worry.</p>\n</blockquote>\n\n<p>This is my concern as well. Once you get past the \"quick Google search provides a few dozen perfectly good answers\" questions, you're stuck trying to attract experts to a site where they may well be a tiny, tiny minority - which misses the whole idea behind SE, where you get experts in some area together to participate in answering questions. </p>\n\n<p>Sure, we could be content aiming for <a href=\"http://meta.htw.stackexchange.com/questions/4/why-is-the-answer-to-most-questions-not-just-a-link-to-howstuffworks-com/5#5\">mediocre</a> <a href=\"http://meta.htw.stackexchange.com/questions/30/potential-for-mass-overlap-with-other-se-sites/31#31\">\"everyman\" answers</a> and hoping that SE Magic somehow makes that work... But then all you've done is create yet another <a href=\"http://en.wikipedia.org/wiki/Content_farm\" rel=\"nofollow\">content farm</a>:</p>\n\n<blockquote>\n  <p>CHACE: Maggio is a military wife who works from home with a Pomeranian on her lap. After looking for work for months in Fairfax, Virginia, where her husband is stationed, she decided to go back to school to get a masters degree in Psychology. She supports herself by freelance writing.</p>\n  \n  <p>Ms. MAGGIO: My best day I wrote 10 in about 75 minutes. So you got to figure, I made 80 bucks in 75 minutes, which is decent. I mean, that's more than I made when I was working full time.</p>\n  \n  <p>CHACE: It's 15 bucks an article for eHow, $8 an article for MadeMan.com, and a buck an article, plus revenue traffic, for Examiner.com.</p>\n  \n  <p>-- NPR's Morning Edition, <em><a href=\"http://www.npr.org/2011/04/22/135625124/google-tweak-s-algorithm-to-spot-content-farms\" rel=\"nofollow\">Google Tweaks Algorithm to Spot Content Farms</a></em></p>\n</blockquote>\n\n<p>...with the same drudgery as the rest of the sites doing this, but without putting anyone through school.</p>\n\n<blockquote>\n  <ol>\n  <li>How do we ensure that we have a never-ending supply of question? Broadening our scope? or something else?</li>\n  <li>How do we distinguish this site from a simple google search // wikipedia search // etc?</li>\n  </ol>\n</blockquote>\n\n<p>There's no reason this site shouldn't have an endless supply of questions. New <em>stuff</em> gets developed all the time, so if the goal is to explain how it works, then that problem is solved...</p>\n\n<p>...But the topic is already too broad and shallow. The solution to competing with Google/Wikipedia is <em>narrow and deep</em>, the exact opposite of where this site is headed.</p>\n", "OwnerUserId": 81, "LastActivityDate": "2011-04-25T20:49:50.217"}
